# ------------ python data frame practice ---------------------- #

In [2]:
import numpy as np 
import pandas as pd 
import matplotlib as plt

### Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels

In [139]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [140]:
df=pd.DataFrame(exam_data, index = labels,columns=['attempts','name','qualify','score'])

In [141]:
df

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5
d         3      James      no    NaN
e         2      Emily      no    9.0
f         3    Michael     yes   20.0
g         1    Matthew     yes   14.5
h         1      Laura      no    NaN
i         2      Kevin      no    8.0
j         1      Jonas     yes   19.0

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   attempts  10 non-null     int64
 1   name      10 non-null     object
 2   qualify   10 non-null     object
 3   score     8 non-null      float64
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

In [9]:
df.head(3)

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5

In [10]:
df[['name','score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

In [11]:
df.loc[:,['name','score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

In [12]:
df.loc[['b','d','f','g'],['name','score']]

      name  score
b     Dima    9.0
d    James    NaN
f  Michael   20.0
g  Matthew   14.5

In [24]:
df1=np.where(df['attempts']>2)

In [25]:
df.iloc[df1]

   attempts     name qualify  score
b         3     Dima      no    9.0
d         3    James      no    NaN
f         3  Michael     yes   20.0

### to find the number of rows and columns of the dataframe

In [48]:
df.shape
#or 
total_rowas= len(df.axes[0])
total_col= len(df.axes[1])
df.head()

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5
d         3      James      no    NaN
e         2      Emily      no    9.0

### TO FIND THE MISSING VALUE

In [38]:
df_miss=np.where(df['score'].isnull() == True)
df.iloc[df_miss]

   attempts   name qualify  score
d         3  James      no    NaN
h         1  Laura      no    NaN

### USING OF BETWEEN 
- pranthesis is must using these kind of operations

In [71]:
df[(df['score']>15) & (df['score']<=20)]
df[df['score'].between(15,20)]

   attempts       name qualify  score
c         2  Katherine     yes   16.5
f         3    Michael     yes   20.0
j         1      Jonas     yes   19.0

In [69]:
df[(df['score']>15) & (df['attempts'] <2)]

   attempts   name qualify  score
j         1  Jonas     yes   19.0

###  Write a Pandas program to change the score in row 'd' to 11.5.

In [73]:
df1=df.copy()
df.head()

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5
d         3      James      no    NaN
e         2      Emily      no    9.0

In [74]:
df.loc['d','attempts']=11.5

In [75]:
df.head()

   attempts       name qualify  score
a       1.0  Anastasia     yes   12.5
b       3.0       Dima      no    9.0
c       2.0  Katherine     yes   16.5
d      11.5      James      no    NaN
e       2.0      Emily      no    9.0

### Write a Pandas program to calculate the sum of the examination attempts by the students.

In [77]:
df['attempts'].sum()

27.5

### Write a Pandas program to calculate the mean score for each different student in DataFrame

In [81]:
mean_score=df.groupby(by='name')
mean_score.mean()

           attempts  score
name
Anastasia       1.0   12.5
Dima            3.0    9.0
Emily           2.0    9.0
James          11.5    NaN
Jonas           1.0   19.0
Katherine       2.0   16.5
Kevin           2.0    8.0
Laura           1.0    NaN
Matthew         1.0   14.5
Michael         3.0   20.0

In [82]:
df['score'].mean()

13.5625

###  Write a Pandas program to append a new row 'k' to data frame with given values for each column. Now delete the new row and return the original DataFrame

In [100]:
df.loc['z']=[3,'ram','no',30]

In [99]:
df.drop('s',axis=1,inplace=True)

In [102]:
df.drop(['k','z'],axis=0)

   attempts       name qualify  score
a       1.0  Anastasia     yes   12.5
b       3.0       Dima      no    9.0
c       2.0  Katherine     yes   16.5
d      11.5      James      no    NaN
e       2.0      Emily      no    9.0
f       3.0    Michael     yes   20.0
g       1.0    Matthew     yes   14.5
h       1.0      Laura      no    NaN
i       2.0      Kevin      no    8.0
j       1.0      Jonas     yes   19.0

### Write a Pandas program to sort the DataFrame first by 'name' in descending order, then by 'score' in ascending order

In [138]:
df.sort_values(by=['name','score'],ascending=[False,True],inplace=True)
df

   attempts    name  qualify  score
d         3  Suresh    False    NaN
i         2     NaN    False    8.0
b         3     NaN    False    9.0
e         2     NaN    False    9.0
a         1     NaN     True   12.5
g         1     NaN     True   14.5
c         2     NaN     True   16.5
j         1     NaN     True   19.0
f         3     NaN     True   20.0
h         1     NaN    False    NaN

### Write a Pandas program to replace the 'qualify' column contains the values 'yes' and 'no' with True and False.

In [121]:
# df['qualify']=np.where(df['qualify']=='yes',True,False)
#or 
df['qualify'] = df['qualify'].map({'yes': True, 'no': False})

#### Write a Pandas program to change the name 'James' to 'Suresh' in name column of the DataFrame

In [143]:
df['name']=df['name'].replace({'James':'Suresh'})

### Write a Pandas program to delete the 'attempts' column from the DataFrame

In [146]:
df1.drop('attempts',axis=1)

        name qualify  score
a  Anastasia     yes   12.5
b       Dima      no    9.0
c  Katherine     yes   16.5
d      James      no    NaN
e      Emily      no    9.0
f    Michael     yes   20.0
g    Matthew     yes   14.5
h      Laura      no    NaN
i      Kevin      no    8.0
j      Jonas     yes   19.0

### Write a Pandas program to iterate over rows in a DataFrame

In [161]:
df.iterrows()
for index, row in df.iterrows():
    print(row['name'],row['score'])

Anastasia 12.5
Dima 9.0
Katherine 16.5
Suresh nan
Emily 9.0
Michael 20.0
Matthew 14.5
Laura nan
Kevin 8.0
Jonas 19.0

### 24. Write a Pandas program to select rows from a given DataFrame based on values in some columns

In [61]:
col1=[1,3,4,5,6,7]
col2=[3,5,6,7,3,8]
df=pd.DataFrame(list(zip(col1,col2)),columns=['col1','col2'],index=['a','b','c','d','e','f'])

In [62]:
df

   col1  col2
a     1     3
b     3     5
c     4     6
d     5     7
e     6     3
f     7     8

###  Write a Pandas program to select rows from a given DataFrame based on values in some columns

In [9]:
df.loc[df['col2']==3]

   col1  col2
0     1     3
4     6     3

### Write a Pandas program to change the order of a DataFrame columns.

In [63]:
df.loc[:,['col2','col1']]

   col2  col1
a     3     1
b     5     3
c     6     4
d     7     5
e     3     6
f     8     7

### --------Write a Pandas program to add one Row in an existing DataFrame-----##

### Adding rows through append()

In [85]:
data = {'name': ['Somu', 'Kiku', 'Amol', 'Lini'],
	'physics': [68, 74, 77, 78],
	'chemistry': [84, 56, 73, 69],
	'algebra': [78, 88, 82, 87]}

In [91]:
marks=pd.DataFrame(data,columns=['name','physics','chemistry','algebra'],index=['a','b','c','d'])
marks1=marks.copy()

In [94]:
# when you are using dictionary 
new_row={'name':'divya','physics':45,'chemistry':67,'algebra':66}
marks1.append(new_row,ignore_index=True)

     name  physics  chemistry  algebra
0    Somu       68         84       78
1    Kiku       74         56       88
2    Amol       77         73       82
3    Lini       78         69       87
4  ashish       45         67       66

In [97]:
# when you not use ignore_index= true , this will return type error 
# so getting rid of that we can use pd.series to fix that 
# for this name also must be defind 
new_row=pd.Series(data= {'name':'divya','physics':45,'chemistry':67,'algebra':66},name='x')
marks1.append(new_row,ignore_index=False)

    name  physics  chemistry  algebra
a   Somu       68         84       78
b   Kiku       74         56       88
c   Amol       77         73       82
d   Lini       78         69       87
x  divya       45         67       66

### Adding rows through loc

In [112]:
marks1.loc['y']=['mohini',45,67,89]

### Write a Pandas program to count city wise number of people from a given of data set (city, name of the person)

In [114]:

df1 = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'city': ['California', 'Los Angeles', 'California', 'California', 'California', 'Los Angeles', 'Los Angeles', 'Georgia', 'Georgia', 'Los Angeles']})

In [115]:
df1

        name         city
0  Anastasia   California
1       Dima  Los Angeles
2  Katherine   California
3      James   California
4      Emily   California
5    Michael  Los Angeles
6    Matthew  Los Angeles
7      Laura      Georgia
8      Kevin      Georgia
9      Jonas  Los Angeles

In [119]:
res=df1.groupby(by='city')
res.count()

#or

g1 = df1.groupby(["city"]).size().reset_index(name='Number of people')
print(g1)

          city  Number of people
0   California                 4
1      Georgia                 2
2  Los Angeles                 4

###  Write a Pandas program to delete DataFrame row(s) based on given column value

In [141]:
col1=[1,3,4,np.nan,6,7]
col2=[3,5,6,7,3,8]
red=pd.DataFrame(list(zip(col1,col2)),columns=['col1','col2'])

In [142]:
red
res=red[red['col2'] !=5]
res

   col1  col2
0   1.0     3
2   4.0     6
3   NaN     7
4   6.0     3
5   7.0     8

### Write a Pandas program to set a given value for particular cell in  DataFrame using index value.

In [135]:
red.reset_index(level=0,inplace=True)

In [134]:
red.drop(['level_0','index'],axis=1,inplace=True)

or 

#df = df.drop(df.index[[2,4]])
#print(df)

In [139]:
print(red.to_string(index=False))

 index  col1  col2
     0     1     3
     1     3     5
     2     4     6
     3     5     7
     4     6     3
     5     7     8

### Write a Pandas program to count the NaN values in one or more columns in DataFrame

In [147]:
res=red.isnull()== True

In [149]:
res.sum().sum()

1

# how to divide the dataset in the specific order

In [154]:
np.random.seed(101)
df=pd.DataFrame(np.random.randn(10,2))

          0         1
0  2.706850  0.628133
1  0.907969  0.503826
2  0.651118 -0.319318
3 -0.848077  0.605965
4 -2.018168  0.740122
5  0.528813 -0.589001
6  0.188695 -0.758872
7 -0.933237  0.955057
8  0.190794  1.978757
9  2.605967  0.683509

In [159]:
res70=df.sample(frac=0.7)
res30=df.drop(res70.index)

In [163]:
res70
res30

          0         1
2  0.651118 -0.319318
6  0.188695 -0.758872
8  0.190794  1.978757

# to suffle the dataset

In [164]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
res=df.sample(frac=1)

In [165]:
res

        name  score  attempts qualify
9      Jonas   19.0         1     yes
8      Kevin    8.0         2      no
0  Anastasia   12.5         1     yes
5    Michael   20.0         3     yes
7      Laura    NaN         1      no
4      Emily    9.0         2      no
3      James    NaN         3      no
6    Matthew   14.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes

###  Write a Pandas program to convert DataFrame column type from string to datetime.

In [170]:
s = pd.Series(['3/11/2000', '3/12/2000', '3/13/2000'])

In [171]:
res=pd.datetime.strptime(s,"%m/%d/%Y")

<ipython-input-171-746f15a6fc34>:1: FutureWarning: The pandas.datetime class is deprecated and will be removed from pandas in a future version. Import from datetime module instead.
  res=pd.datetime.strptime(s,"%m/%d/%Y")

TypeError: strptime() argument 1 must be str, not Series

### Write a Pandas program to find the row for where the value of a given column is maximum

In [4]:
d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df=pd.DataFrame(d)
df

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

In [20]:
def maximu(col):
    res=np.where(df[col]==max(df[col]))
    return res

In [22]:
maximu('col3')

(array([2], dtype=int64),)

In [24]:
# or use argmax()
df['col2'].argmax()

3

## Write a Pandas program to convert the datatype of a given column(floats to ints)

exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9.1, 16.5, 12.77, 9.21, 20.22, 14.5, 11.34, 8.8, 19.13],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

df=pd.DataFrame(exam_data)

In [31]:
df.dtypes

name        object
score        int64
attempts     int64
qualify     object
dtype: object

In [30]:
df['score']=df['score'].astype('int64')

## Write a Pandas program to remove infinite values from a given DataFrame.

In [33]:
df = pd.DataFrame([1000, 2000, 3000, -4000, np.inf, -np.inf])
print("Original DataFrame:")
print(df)
print("Removing infinite values:")
df = df.replace([np.inf, -np.inf], np.nan)
print(df)

Original DataFrame:
        0
0  1000.0
1  2000.0
2  3000.0
3 -4000.0
4     inf
5    -inf
Removing infinite values:
        0
0  1000.0
1  2000.0
2  3000.0
3 -4000.0
4     NaN
5     NaN

## Write a Pandas program to insert a given column at a specific column index in a DataFrame

In [36]:
d = {'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(data=d)
col1=[3,4,5,6,7]

df.insert(0,column='col1',value=col1)

In [37]:
df

   col1  col2  col3
0     3     4     7
1     4     5     8
2     5     6    12
3     6     9     1
4     7     5    11

## Write a Pandas program to convert a given list of lists into a Dataframe

In [79]:
my_lists = [['col1', 'col2'], [2, 4], [1, 3]]
heade=my_lists.pop(0)

In [80]:
df=pd.DataFrame(my_lists,columns=heade)

In [82]:
df['col2'].index()

TypeError: 'RangeIndex' object is not callable

### Write a Pandas program to group by the first column and get second column as lists in rows

In [52]:
df = pd.DataFrame( {'col1':['C1','C1','C2','C2','C2','C3','C2'], 'col2':[1,2,3,3,4,6,5]})

In [54]:
res=df.groupby(by='col1')

In [73]:
res['col2'].apply(list)

col1
C1          [1, 2]
C2    [3, 3, 4, 5]
C3             [6]
Name: col2, dtype: object

###  Write a Pandas program to get column index from column name of a given DataFrame.

In [85]:
d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(data=d)

In [ ]:
col=df.columns

In [91]:
col.get_loc('col2')

1

### Write a Pandas program to select all columns, except one given column in a DataFrame

In [96]:
df.loc[:,df.columns != 'col2']

   col1  col3
0     1     7
1     2     8
2     3    12
3     4     1
4     7    11

### Write a Pandas program to get topmost n records within each group of a DataFrame.

In [97]:
d = {'col1': [1, 2, 3, 4, 7, 11], 'col2': [4, 5, 6, 9, 5, 0], 'col3': [7, 5, 8, 12, 1,11]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
print("\ntopmost n records within each group of a DataFrame:")
df1 = df.nlargest(3, 'col1')
print(df1)
df2 = df.nlargest(3, 'col2')
print(df2)
df3 = df.nlargest(3, 'col3')
print(df3)

Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11

topmost n records within each group of a DataFrame:
   col1  col2  col3
5    11     0    11
4     7     5     1
3     4     9    12
   col1  col2  col3
3     4     9    12
2     3     6     8
1     2     5     5
   col1  col2  col3
3     4     9    12
5    11     0    11
2     3     6     8

### Write a Pandas program to add a prefix or suffix to all columns of a given DataFrame.

In [98]:
df = pd.DataFrame({'W':[68,75,86,80,66],'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
print("Original DataFrame")
print(df)
print("\nAdd prefix:")
print(df.add_prefix("A_"))
print("\nAdd suffix:")
print(df.add_suffix("_1"))

Original DataFrame
    W   X   Y   Z
0  68  78  84  86
1  75  85  94  97
2  86  96  89  96
3  80  80  83  72
4  66  86  86  83

Add prefix:
   A_W  A_X  A_Y  A_Z
0   68   78   84   86
1   75   85   94   97
2   86   96   89   96
3   80   80   83   72
4   66   86   86   83

Add suffix:
   W_1  X_1  Y_1  Z_1
0   68   78   84   86
1   75   85   94   97
2   86   96   89   96
3   80   80   83   72
4   66   86   86   83

### Write a Pandas program to reverse order (rows, columns) of a given DataFrame.

In [99]:
df = pd.DataFrame({'W':[68,75,86,80,66],'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
print("Original DataFrame")
print(df)
print("\nReverse column order:")
print(df.loc[:, ::-1])
print("\nReverse row order:")
print(df.loc[::-1])
print("\nReverse row order and reset index:")
print(df.loc[::-1].reset_index(drop = True))

Original DataFrame
    W   X   Y   Z
0  68  78  84  86
1  75  85  94  97
2  86  96  89  96
3  80  80  83  72
4  66  86  86  83

Reverse column order:
    Z   Y   X   W
0  86  84  78  68
1  97  94  85  75
2  96  89  96  86
3  72  83  80  80
4  83  86  86  66

Reverse row order:
    W   X   Y   Z
4  66  86  86  83
3  80  80  83  72
2  86  96  89  96
1  75  85  94  97
0  68  78  84  86

Reverse row order and reset index:
    W   X   Y   Z
0  66  86  86  83
1  80  80  83  72
2  86  96  89  96
3  75  85  94  97
4  68  78  84  86

### Write a Pandas program to select columns by data type of a given DataFrame

In [100]:
df = pd.DataFrame({
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'date_of_birth': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22, 23]
})

In [103]:
df1=pd.DataFrame(df,columns=['name','date_of_birth','age'])
df1

             name date_of_birth   age
0  Alberto Franco    17/05/2002  18.5
1    Gino Mcneill    16/02/1999  21.2
2     Ryan Parkes    25/09/1998  22.5
3    Eesha Hinton    11/05/2002  22.0
4    Syed Wharton    15/09/1997  23.0

In [104]:
df1.dtypes

name              object
date_of_birth     object
age              float64
dtype: object

In [115]:
# method 1
np.where(df1.dtypes == 'float64')
df1.iloc[:,2]

0    18.5
1    21.2
2    22.5
3    22.0
4    23.0
Name: age, dtype: float64

In [116]:
#method 2
print(df.select_dtypes(include = "number"))

    age
0  18.5
1  21.2
2  22.5
3  22.0
4  23.0

In [119]:
#method(3)
df1.dtypes== "float64"
a=df1.dtypes[df1.dtypes == "float64"].index
print(a)
df1.loc[:,'age']

Index(['age'], dtype='object')

0    18.5
1    21.2
2    22.5
3    22.0
4    23.0
Name: age, dtype: float64

### Write a Pandas program to merge datasets and check uniqueness.

In [12]:
df = pd.DataFrame({
    'Name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'Date_Of_Birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'Age': [18.5, 21.2, 22.5, 22, 23]
})
print("Original DataFrame:")
print(df)
df1 = df.copy(deep = True)
df = df.drop([0, 1])
df1 = df1.drop([2])
print("\nNew DataFrames:")
print(df)
print(df1)
print('\n"one_to_one”: check if merge keys are unique in both left and right datasets:"')
df_one_to_one = pd.merge(df, df1, validate = "one_to_one")
print(df_one_to_one)
print('\n"one_to_many” or “1:m”: check if merge keys are unique in left dataset:')
df_one_to_many = pd.merge(df, df1, validate = "one_to_many")
print(df_one_to_many)
print('“many_to_one” or “m:1”: check if merge keys are unique in right dataset:')
df_many_to_one = pd.merge(df, df1, validate = "many_to_one")
print(df_many_to_one)

Original DataFrame:
             Name Date_Of_Birth    Age
0  Alberto Franco     17/05/2002  18.5
1    Gino Mcneill     16/02/1999  21.2
2     Ryan Parkes     25/09/1998  22.5
3    Eesha Hinton     11/05/2002  22.0
4    Syed Wharton     15/09/1997  23.0

New DataFrames:
           Name Date_Of_Birth    Age
2   Ryan Parkes     25/09/1998  22.5
3  Eesha Hinton     11/05/2002  22.0
4  Syed Wharton     15/09/1997  23.0
             Name Date_Of_Birth    Age
0  Alberto Franco     17/05/2002  18.5
1    Gino Mcneill     16/02/1999  21.2
3    Eesha Hinton     11/05/2002  22.0
4    Syed Wharton     15/09/1997  23.0

"one_to_one”: check if merge keys are unique in both left and right datasets:"
           Name Date_Of_Birth    Age
0  Eesha Hinton     11/05/2002  22.0
1  Syed Wharton     15/09/1997  23.0

"one_to_many” or “1:m”: check if merge keys are unique in left dataset:
           Name Date_Of_Birth    Age
0  Eesha Hinton     11/05/2002  22.0
1  Syed Wharton     15/09/1997  23.0
“many_to_one” or “m:1”: check if merge keys are unique in right dataset:
           Name Date_Of_Birth    Age
0  Eesha Hinton     11/05/2002  22.0
1  Syed Wharton     15/09/1997  23.0

### Write a Pandas program to convert continuous values of a column in a given DataFrame to categorical

In [13]:
df = pd.DataFrame({
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton', 'Kierra Gentry'],
      'age': [18, 22, 85, 50, 80, 5]
})

In [35]:
category=pd.cut(df['age'],bins=[0,18,40,80,90],labels=['kids','young','old','oldest'])

In [36]:
df

             name  age age_group
0  Alberto Franco   18      kids
1    Gino Mcneill   22     young
2     Ryan Parkes   85    oldest
3    Eesha Hinton   50       old
4    Syed Wharton   80       old
5   Kierra Gentry    5      kids

In [38]:
# insert is used to add the columns in the dataframe 
df.insert(1,'age_grou',category)

In [40]:
df.head()

             name age_grou  age age_group
0  Alberto Franco     kids   18      kids
1    Gino Mcneill    young   22     young
2     Ryan Parkes   oldest   85    oldest
3    Eesha Hinton      old   50       old
4    Syed Wharton      old   80       old

###  Write a Pandas program to create DataFrames that contains random values, contains missing values, contains datetime values and contains mixed values.

In [41]:
import pandas as pd
print("DataFrame: Contains random values:")
df1 = pd.util.testing.makeDataFrame() # contains random values
print(df1)
print("\nDataFrame: Contains missing values:")
df2 = pd.util.testing.makeMissingDataframe() # contains missing values
print(df2)
print("\nDataFrame: Contains datetime values:")
df3 = pd.util.testing.makeTimeDataFrame() # contains datetime values
print(df3)
print("\nDataFrame: Contains mixed values:")
df4 = pd.util.testing.makeMixedDataFrame() # contains mixed values
print(df4)

DataFrame: Contains random values:

C:\Users\Asus\anaconda3\lib\site-packages\pandas\util\__init__.py:12: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

                   A         B         C         D
knEHGssR6u  1.047590 -0.727642 -0.555484 -0.862700
ziH3Rd9PLG  0.645190 -0.315940 -0.261230 -1.260376
lADX0aJ4VM -0.737389 -0.702099 -0.356461 -0.090952
CQxGfg0sYi  0.654644 -1.047078  1.194411 -1.098010
Z9kZg403TB -1.140362 -1.503051 -0.841418  0.128991
v8r922ncgI  0.331405  0.373618  1.134803 -1.742907
sfjm6whkZF -1.600687  0.183599  0.431288  0.899602
tsoVeE2iX6  0.201869  0.007304 -0.390069 -0.436029
grS9VT3pIA  0.292651  0.708081 -2.425667  0.352831
wCDnR8XnSs  0.372743  0.923940  1.037393 -0.928868
vM7dmqbrw4  0.662781  1.827255 -0.976387  0.111719
hYnEQaDcQt -0.856133 -0.229616  0.201849 -0.801489
fdSA80rI3C -0.170610  0.346433  0.671215 -1.680437
n8YhVHuxDr  0.226489  0.365397 -0.020468  1.416293
K5gjbhbnkk -1.239131 -0.429656 -0.254031  2.030146
gs9aCDMibM  0.029213  0.272553  1.297802  0.319424
Vh4PiWB5IB  1.611733  0.881090  0.406605 -1.933476
ndID7dcw6D -1.394398 -0.911218 -1.009799 -0.015820
Pl4T5Pk6oK  1.437781 -0.717268 -0.543905 -0.220112
YplDBmU9PY  0.741597  0.322217 -0.935617 -0.907174
frDgJxYEb2 -0.867061  0.703886 -1.212774 -0.280218
3JweQJDpIm -1.432684  1.012771  0.656854  0.679532
0LHKReRvJI  2.863502 -0.302800  0.436409  2.599607
i0V3231eLA  0.020611 -2.246481  0.596153 -0.885693
DHHUFjZDhB  0.301599  0.863640 -0.181497 -0.890611
eFzDVaQKkP  0.824962  0.616309  1.306924  1.009061
aMuF1EaLwN -0.535142 -0.657935  0.827586 -0.701874
JddO6KjKQv -1.771084 -0.937242 -1.079539  0.072025
bjh84fSKYJ  1.593453  1.252231  0.423327  1.316012
OgL1MfFuyQ -0.663644 -1.461133 -0.343930 -0.871978

DataFrame: Contains missing values:
                   A         B         C         D
qnCERZbknp  0.674353  0.779379 -1.164566  1.628461
oq2ZPjodU2 -0.849360  1.677583       NaN  1.469288
6LJLcdfxD7 -0.444477  0.168689  0.456793 -0.128348
CFKKDufgL4  0.569576       NaN  1.801449 -0.179091
P9YuU69UCQ -1.073755  0.775108  0.940626  0.800281
X5Rqxwa2F5 -0.283173  0.472040  0.543041  0.206534
ibsmLS76BN  0.492986 -1.018079 -0.683633  0.735298
KbBOX0dCXd -1.101590  0.481529 -1.570894 -1.944347
Pyuwo0jyQM  0.359091 -1.017436  1.104040  0.444149
MxtLUVusGw -1.360365 -1.130480       NaN -2.047656
u9sAHD8RRH -1.891218 -0.562515  0.811370  1.124000
8Hp7MvNveQ  0.498696 -0.983042 -0.051874  1.743581
jBIJtxFj1y  0.607204 -0.577366 -1.192740  0.317354
kiKpkZJ3o7  0.402563  0.334726  2.638063  0.626078
TPGMQcIw4w       NaN  0.604854  0.125241 -1.030357
hGCRFuqw3h       NaN -0.536030 -0.549741  0.531800
AXlpl7dr3N       NaN -0.395633 -0.382976  0.160942
uhZCoY0pBd -1.016902       NaN  0.138058  0.572029
Mz81QD9tmo  0.860872 -0.200735 -0.339854       NaN
BQTsp3HrlJ -0.464576 -0.385969  1.132805 -1.647245
SswurH3vCh -0.506983  0.136771 -0.663525  1.586515
rE2ob2R6HN -0.438824 -0.224810  0.212398       NaN
fK4YI4XwkH -0.213752       NaN  0.450384 -0.793379
LmEHK61KIy -0.547177       NaN -0.514090 -0.970512
VzVCDXrUUa  0.682301 -0.124642 -0.023082  0.237830
TttAj6cEjo       NaN -0.337631 -0.584526  1.077436
DpT2dbfF73 -0.199439 -0.060704 -0.040328 -1.319659
rV0tgFHiwP  0.388762  2.447492  0.182582  1.313856
UxHtWKKA80  0.260244  0.352056 -1.374684 -0.468615
0DT7pbzt8q  1.335379  1.579072  1.106014 -1.710388

DataFrame: Contains datetime values:
                   A         B         C         D
2000-01-03  1.787538 -1.387930  0.798710 -0.268444
2000-01-04  0.535546  1.208871  0.152313 -0.435599
2000-01-05 -0.152796  0.284196  0.498642 -0.390271
2000-01-06  0.889079  0.137060 -1.385858  0.250693
2000-01-07 -0.209961  0.347554 -1.006803 -0.326623
2000-01-10 -0.340863 -0.701677 -1.137606  0.379515
2000-01-11 -1.781367  0.022855 -0.277056  0.206729
2000-01-12  0.922210  0.100861  0.946556 -2.073453
2000-01-13 -0.731155 -0.720753 -0.110006  0.440847
2000-01-14  0.566381 -1.293997  0.428340 -0.493459
2000-01-17  0.172059 -0.490520 -1.523970 -0.615162
2000-01-18  1.348596 -0.825379 -1.283779  0.887122
2000-01-19 -0.330326 -1.148586  1.932701  0.116632
2000-01-20 -0.811576  2.028062  0.431564 -0.638109
2000-01-21 -0.754708  0.831826 -0.175299 -0.655423
2000-01-24 -0.225468 -1.268225 -0.133932  0.307654
2000-01-25 -0.075405 -0.477397  0.171571 -0.095131
2000-01-26 -0.265961 -0.213115  0.000970  0.375908
2000-01-27  0.776299 -0.990328 -0.708357 -1.263492
2000-01-28 -0.384686 -0.548425 -0.240918  2.041760
2000-01-31  0.913355 -0.670156  2.124909 -2.709408
2000-02-01 -0.279887  0.267963 -0.267413 -0.149151
2000-02-02 -0.386219 -0.693792  0.478800 -2.021433
2000-02-03 -3.807925 -0.192553  0.105036 -2.271366
2000-02-04 -0.860290  0.865705  0.244545  0.586100
2000-02-07  0.728207 -0.646095 -0.529574  1.389854
2000-02-08 -0.825655 -0.168078  1.277149  0.358864
2000-02-09 -2.424396  0.921248 -0.287141  2.152179
2000-02-10  0.268819  1.808105  0.146968  0.871011
2000-02-11 -0.637361  0.171452  0.830155 -1.889124

DataFrame: Contains mixed values:
     A    B     C          D
0  0.0  0.0  foo1 2009-01-01
1  1.0  1.0  foo2 2009-01-02
2  2.0  0.0  foo3 2009-01-05
3  3.0  1.0  foo4 2009-01-06
4  4.0  0.0  foo5 2009-01-07

###  Write a Pandas program to fill missing values in time series data.

In [42]:
sdata = {"c1":[120, 130 ,140, 150, np.nan, 170], "c2":[7, np.nan, 10, np.nan, 5.5, 16.5]}
df = pd.DataFrame(sdata)
df.index = pd.util.testing.makeDateIndex()[0:6]
print("Original DataFrame:")
print(df)
print("\nDataFrame after interpolate:")
print(df.interpolate())

Original DataFrame:
               c1    c2
2000-01-03  120.0   7.0
2000-01-04  130.0   NaN
2000-01-05  140.0  10.0
2000-01-06  150.0   NaN
2000-01-07    NaN   5.5
2000-01-10  170.0  16.5

DataFrame after interpolate:
               c1     c2
2000-01-03  120.0   7.00
2000-01-04  130.0   8.50
2000-01-05  140.0  10.00
2000-01-06  150.0   7.75
2000-01-07  160.0   5.50
2000-01-10  170.0  16.50

## Write a Pandas program to use a local variable within a query.

In [44]:
import pandas as pd
df = pd.DataFrame({'W':[68,75,86,80,66],'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
print("Original DataFrame")
print(df)
maxx = df["W"].max()
print("\nValues which are less than maximum value of 'W' column")
print(df.query("W < @maxx"))

Original DataFrame
    W   X   Y   Z
0  68  78  84  86
1  75  85  94  97
2  86  96  89  96
3  80  80  83  72
4  66  86  86  83

Values which are less than maximum value of 'W' column
    W   X   Y   Z
0  68  78  84  86
1  75  85  94  97
3  80  80  83  72
4  66  86  86  83

### Write a Pandas program to clean object column with mixed data of a given DataFrame using regular expression.

In [45]:
import pandas as pd
d = {"agent": ["a001", "a002", "a003", "a003", "a004"], "purchase":[4500.00, 7500.00, "$3000.25", "$1250.35", "9000.00"]}
df = pd.DataFrame(d)
print("Original dataframe:")
print(df)
print("\nData Types:")
print(df["purchase"].apply(type))
df["purchase"] = df["purchase"].replace("[$,]", "", regex = True).astype("float")
print("\nNew Data Types:")
print(df["purchase"].apply(type))

Original dataframe:
  agent  purchase
0  a001      4500
1  a002      7500
2  a003  $3000.25
3  a003  $1250.35
4  a004   9000.00

Data Types:
0    <class 'float'>
1    <class 'float'>
2      <class 'str'>
3      <class 'str'>
4      <class 'str'>
Name: purchase, dtype: object

New Data Types:
0    <class 'float'>
1    <class 'float'>
2    <class 'float'>
3    <class 'float'>
4    <class 'float'>
Name: purchase, dtype: object

### Write a Pandas program to get the numeric representation of an array by identifying distinct values of a given column of a DataFrame.

In [46]:
df = pd.DataFrame({
    'Name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill'],
    'Date_Of_Birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'Age': [18.5, 21.2, 22.5, 22, 23]
})
print("Original DataFrame:")
print(df)
label1, unique1 = pd.factorize(df['Name'])
print("\nNumeric representation of an array by identifying distinct values:")
print(label1)
print(unique1)

Original DataFrame:
             Name Date_Of_Birth    Age
0  Alberto Franco     17/05/2002  18.5
1    Gino Mcneill     16/02/1999  21.2
2     Ryan Parkes     25/09/1998  22.5
3    Eesha Hinton     11/05/2002  22.0
4    Gino Mcneill     15/09/1997  23.0

Numeric representation of an array by identifying distinct values:
[0 1 2 3 1]
Index(['Alberto Franco', 'Gino Mcneill', 'Ryan Parkes', 'Eesha Hinton'], dtype='object')

In [47]:
# Write a Pandas program to replace the current value in a dataframe column based on last largest value. If the current value is less than last largest value replaces the value with 0.
df1=pd.DataFrame({'rnum':[23, 21, 27, 22, 34, 33, 34, 31, 25, 22, 34, 19, 31, 32, 19]})
print("Original DataFrame:")
print(df1)
df1['rnum']=df1.rnum.where(df1.rnum.eq(df1.rnum.cummax()),0)
print("\nReplace current value in a dataframe column based on last largest value:")
print(df1)

Original DataFrame:
    rnum
0     23
1     21
2     27
3     22
4     34
5     33
6     34
7     31
8     25
9     22
10    34
11    19
12    31
13    32
14    19

Replace current value in a dataframe column based on last largest value:
    rnum
0     23
1      0
2     27
3      0
4     34
5      0
6     34
7      0
8      0
9      0
10    34
11     0
12     0
13     0
14     0

### Write a Pandas program to get lowest n records within each group of a given DataFrame.

In [48]:
import pandas as pd
d = {'col1': [1, 2, 3, 4, 7, 11], 'col2': [4, 5, 6, 9, 5, 0], 'col3': [7, 5, 8, 12, 1,11]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
print("\nLowest n records within each group of a DataFrame:")
df1 = df.nsmallest(3, 'col1')
print(df1)
df2 = df.nsmallest(3, 'col2')
print(df2)
df3 = df.nsmallest(3, 'col3')
print(df3)

Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11

Lowest n records within each group of a DataFrame:
   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
   col1  col2  col3
5    11     0    11
0     1     4     7
1     2     5     5
   col1  col2  col3
4     7     5     1
1     2     5     5
0     1     4     7